---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.ForwardIterator
source: html/1b12b26e-d988-4115-c2b7-eb7a582a8dbe.htm
---
# Autodesk.Revit.DB.CombinableElementArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CombinableElementArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.